TheZeroHz/ESP32CSI_Vision/src/espdl/pedestrian_detect/pedestrian_detect.cpp
#include "pedestrian_detect.hpp"

#include <filesystem>

#include "esp_log.h"
#include "storage/esp32p4_model_mount.h"

#if CONFIG_PEDESTRIAN_DETECT_MODEL_IN_FLASH_RODATA
extern const uint8_t pedestrian_detect_espdl[] asm("_binary_pedestrian_detect_espdl_start");
static const char *path = (const char *)pedestrian_detect_espdl;
#elif CONFIG_PEDESTRIAN_DETECT_MODEL_IN_FLASH_PARTITION
static const char *path = "pedestrian_det";
#endif

namespace pedestrian_detect {

Pico::Pico(const char *model_name, float score_thr, float nms_thr)
{
#if !CONFIG_PEDESTRIAN_DETECT_MODEL_IN_SDCARD
    m_model = new dl::Model(
        path, model_name, static_cast<fbs::model_location_type_t>(CONFIG_PEDESTRIAN_DETECT_MODEL_LOCATION));
#else
    auto sd_path = std::filesystem::path(esp32p4_model_mount_point()) /
                   CONFIG_PEDESTRIAN_DETECT_MODEL_SDCARD_DIR / model_name;
    m_model = new dl::Model(sd_path.c_str(), fbs::MODEL_LOCATION_IN_SDCARD);
#endif
    m_model->minimize();
    m_image_preprocessor = new dl::image::ImagePreprocessor(m_model, {0, 0, 0}, {1, 1, 1});
    m_postprocessor = new dl::detect::PicoPostprocessor(
        m_model, m_image_preprocessor, score_thr, nms_thr, 10, {{8, 8, 4, 4}, {16, 16, 8, 8}, {32, 32, 16, 16}});
}

} // namespace pedestrian_detect

PedestrianDetect::PedestrianDetect(model_type_t model_type, bool lazy_load) : m_model_type(model_type)
{
    switch (model_type) {
    case model_type_t::PICO_S8_V1:
        m_score_thr[0] = pedestrian_detect::Pico::default_score_thr;
        m_nms_thr[0] = pedestrian_detect::Pico::default_nms_thr;
        break;
    }
    if (lazy_load) {
        m_model = nullptr;
    } else {
        load_model();
    }
}

void PedestrianDetect::load_model()
{
    switch (m_model_type) {
    case model_type_t::PICO_S8_V1:
#if CONFIG_FLASH_PEDESTRIAN_DETECT_PICO_S8_V1 || CONFIG_PEDESTRIAN_DETECT_MODEL_IN_SDCARD
        m_model = new pedestrian_detect::Pico("pedestrian_detect_pico_s8_v1.espdl", m_score_thr[0], m_nms_thr[0]);
#else
        ESP_LOGE("pedestrian_detect", "pedestrian_detect_s8_v1 is not selected in menuconfig.");
#endif
        break;
    }
}

